SiliconLabsSoftware/devs-refd-lorawan/projects/lorawan_extension/components/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
  // Setup radio and relative irq
  smtc_modem_hal_irq_config_radio_irq(radio_rx_irq_callback, NULL);

  smtc_modem_hal_start_radio_tcxo( );
  smtc_modem_hal_set_ant_switch(false);
  if ( ralf_setup_lora(&modem_radio, &rx_lora_param) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ralf_setup_lora() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  if ( ral_set_dio_irq_params(&(modem_radio.ral), RAL_IRQ_RX_DONE | RAL_IRQ_RX_TIMEOUT | RAL_IRQ_RX_HDR_ERROR
                              | RAL_IRQ_RX_CRC_ERROR) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_set_dio_irq_params() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  // Wait 5ms to start
  uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( ) + wait_start_ms;
  while ( smtc_modem_hal_get_time_in_ms( ) < start_time_ms ) {
    // Do nothing
  }

  if ( ral_set_rx(&(modem_radio.ral), 0) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_set_rx() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  while ( radio_irq_raised == false ) {
    // Do nothing
  }

  if ( irq_rx_timeout_raised == false ) {
    PORTING_TEST_MSG_WARN("\n Radio irq received but not RAL_IRQ_RX_TIMEOUT -> relaunched test \n ");
    return RC_PORTING_TEST_RELAUNCH;
  }

  uint32_t time = irq_time_ms - start_time_ms;
  if (abs(time - symb_time_ms) <= MARGIN_GET_TIME_IN_MS ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF(" Time expected %lums / get %lums (margin +/-%ums) \n", ( uint32_t ) symb_time_ms, time,
                          MARGIN_GET_TIME_IN_MS);
  } else {
    PORTING_TEST_MSG_NOK(" Time is not coherent with radio irq : expected %lums / get %lums (margin +/-%ums) \n",
                         ( uint32_t ) symb_time_ms, time, MARGIN_GET_TIME_IN_MS);
    return RC_PORTING_TEST_NOK;
  }
  return RC_PORTING_TEST_OK;
}

/**
 * @brief Test time (Get time in s and in ms)
 *
 * @remark See test_get_time_in_s() and test_get_time_in_ms() functions
 *
 * @return bool True if test is successful
 */
static bool porting_test_get_time(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_get_time : \n");

  return_code_test_t ret = RC_PORTING_TEST_OK;

  do {
    ret = test_get_time_in_s( );
    if ( ret == RC_PORTING_TEST_NOK ) {
      return false;
    }
  } while ( ret == RC_PORTING_TEST_RELAUNCH );

  do {
    ret = test_get_time_in_ms( );
    if ( ret == RC_PORTING_TEST_NOK ) {
      return false;
    }
  } while ( ret == RC_PORTING_TEST_RELAUNCH );

  return true;
}

/**
 * @brief Test timer IRQ
 *
 * @warning smtc_modem_hal_start_timer() function takes ~4ms for STM32L4 (see HAL_LPTIM_TimeOut_Start_IT())
 *
 * @remark
 * Test processing:
 * - Get start time
 * - Configure and start timer
 * - Wait timer irq (get stop time in irq callback)
 * - Check the time elapsed between timer start and timer IRQ reception
 *
 * Ported functions:
 * smtc_modem_hal_start_timer
 *      hal_lp_timer_start
 *
 * @return bool True if test is successful
 */
static bool porting_test_timer_irq(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_timer_irq : ");

  uint32_t timer_ms      = 3000;
  uint8_t  wait_start_ms = 5;
  uint16_t timeout_ms    = 2000;
  timer_irq_raised       = false;

  smtc_modem_hal_stop_timer( );

  // Wait 5ms to start
  uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( ) + wait_start_ms;

  while ( smtc_modem_hal_get_time_in_ms( ) < start_time_ms ) {
    // Do nothing
  }

  smtc_modem_hal_start_timer(timer_ms, timer_irq_callback,
                             NULL);

  // Timeout if irq not raised
  while ( (timer_irq_raised == false)
          && ( (smtc_modem_hal_get_time_in_ms( ) - start_time_ms) < (timer_ms + timeout_ms) ) ) {
    // Do nothing
  }

  if ( timer_irq_raised == false ) {
    PORTING_TEST_MSG_NOK(" Timeout: timer irq not received \n");
    return false;
  }

  uint32_t time = irq_time_ms - start_time_ms - BOARD_COMPENSATION_IN_MS;

  if ( (time >= timer_ms) && (time <= timer_ms + MARGIN_TIMER_IRQ_IN_MS) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF("Timer irq configured with %lums / get %lums (margin +%ums) \n", timer_ms, time,
                          MARGIN_TIMER_IRQ_IN_MS);
  } else {
    PORTING_TEST_MSG_NOK(" Timer irq delay is not coherent: expected %lums / get %lums (margin +%ums) \n", timer_ms,
                         time, MARGIN_TIMER_IRQ_IN_MS);
    return false;
  }
  return true;
}

/**
 * @brief Test stop timer
 *
 * @remark
 * Test processing:
 * - Configure and start timer
 * - Wait
 * - Stop timer
 * - Wait the end of timer
 * - Check if timer IRQ is not received
 *
 * Ported functions:
 * smtc_modem_hal_stop_timer
 *      hal_lp_timer_stop
 *
 * @return bool True if test is successful
 */
static bool porting_test_stop_timer(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_stop_timer : ");

  uint32_t timer_ms = 1000;
  timer_irq_raised  = false;

  smtc_modem_hal_start_timer(timer_ms, timer_irq_callback, NULL);

  // Wait half of timer
  uint32_t time = smtc_modem_hal_get_time_in_ms( );
  while ( (smtc_modem_hal_get_time_in_ms( ) - time) < (timer_ms / 2) ) {
    // Do nothing
  }

  smtc_modem_hal_stop_timer( );

  // Wait a little more than the end of timer
  time = smtc_modem_hal_get_time_in_ms( );
  while ( (smtc_modem_hal_get_time_in_ms( ) - time) < (timer_ms + 500) ) {
    // Do nothing
  }

  if ( timer_irq_raised == false ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_NOK(" Timer irq raised while timer is stopped \n");
    return false;
  }
  return true;
}

/**
 * @brief Test enable/disable irq
 *
 * @remark
 * Test processing:
 * - Disable irq
 * - Start timer with irq
 * - Wait the end of timer
 * - Check if timer irq is not raised
 * - Enable irq
 * - Check if timer irq is raised
 *
 * Ported functions:
 * smtc_modem_hal_disable_modem_irq
 * smtc_modem_hal_enable_modem_irq
 *
 * @return bool True if test is successful
 */
static bool porting_test_disable_enable_irq(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_disable_enable_irq : ");

  uint32_t timer_ms = 3000;
  timer_irq_raised  = false;

  smtc_modem_hal_disable_modem_irq( );
  smtc_modem_hal_start_timer(timer_ms, timer_irq_callback, NULL);

  // Wait a little more than the end of timer
  uint32_t time = smtc_modem_hal_get_time_in_ms( );
  while ( (smtc_modem_hal_get_time_in_ms( ) - time) < (timer_ms + 1000) ) {
    // Do nothing
  }

