SiliconLabsSoftware/devs-refd-lorawan/projects/lorawan_extension/components/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
  if ( timer_irq_raised == true ) {
    PORTING_TEST_MSG_NOK("Timer irq raised while irq is disabled\n");
    return false;
  }

  smtc_modem_hal_enable_modem_irq();

  if ( timer_irq_raised == true ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_NOK(" Timer irq not received while irq is re-enabled \n");
    return false;
  }

  return true;
}

/**
 * @brief Test get random numbers
 *
 * @remark
 * Test processing:
 * 1) - Get 2 random numbers in full range
 * - Check if numbers are not equals to 0 and are different
 * 2) - Get 2 random numbers in a defined range
 * - Check if numbers are different and in the defined range
 * 3) - Get random draw of numbers between in a defined range
 * - Check if draw of each value is equivalent
 *
 * Ported functions:
 * smtc_modem_hal_get_random_nb_in_range
 *      hal_rng_get_random_in_range
 *
 * @return bool True if test is successful
 */
static bool porting_test_random(void)
{
  bool ret = true;

  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_random : \n");

  SMTC_HAL_TRACE_MSG(" * Get random nb : ");
  uint32_t rdom1 = smtc_modem_hal_get_random_nb_in_range(0, 0xFFFFFFFF);
  uint32_t rdom2 = smtc_modem_hal_get_random_nb_in_range(0, 0xFFFFFFFF);

  if ( (rdom1 != 0) && (rdom2 != 0) && (rdom1 != rdom2) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF(" random1 = %lu, random2 = %lu\n", rdom1, rdom2);
  } else {
    PORTING_TEST_MSG_WARN("\n => random1 = %lu, random2 = %lu\n", rdom1, rdom2);
    ret = false;
  }

  SMTC_HAL_TRACE_MSG(" * Get random nb in range : ");
  uint32_t range_min = 1;
  uint32_t range_max = 42;

  rdom1 = smtc_modem_hal_get_random_nb_in_range(range_min, range_max);
  rdom2 = smtc_modem_hal_get_random_nb_in_range(range_min, range_max);

  if ( (rdom1 >= range_min) && (rdom1 <= range_max) && (rdom2 >= range_min) && (rdom2 <= range_max)
       && (rdom1 != rdom2) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF(" random1 = %lu, random2 = %lu in range [%lu;%lu]\n", rdom1, rdom2, range_min, range_max);
  } else {
    PORTING_TEST_MSG_WARN("\n => random1 = %lu, random2 = %lu, expected range [%lu;%lu]\n", rdom1, rdom2, range_min,
                          range_max);
    ret = false;
  }

  SMTC_HAL_TRACE_MSG(" * Get random draw : ");
  range_min                       = 1;
  range_max                       = 10;
  uint32_t tab_counter_random[10] = { 0 };
#ifdef SL_CATALOG_KERNEL_PRESENT
  uint32_t nb_draw                = 50000; // Reduced to limit the blocking time in RTOS
#else
  uint32_t nb_draw                = 100000;
#endif
  uint32_t probability_draw       = nb_draw / (range_max - range_min + 1);
  // Warning to be update if probability_draw is changed
  int16_t margin = (probability_draw * 5) / 100;      // error margin = 5% of probability_draw

  for ( uint32_t i = 0; i < nb_draw; i++ ) {
    rdom1 = smtc_modem_hal_get_random_nb_in_range(range_min, range_max);
    tab_counter_random[rdom1 - 1]++;
  }

  uint8_t tab_size = sizeof(tab_counter_random) / sizeof(uint32_t);
  for ( uint16_t i = 0; i < tab_size; i++ ) {
    if ( abs(probability_draw - tab_counter_random[i]) > margin ) {
      PORTING_TEST_MSG_WARN("\n => The number %u has been drawned %lu times, Expected [%lu;%lu] times \n",
                            (i + 1), tab_counter_random[i], (probability_draw - margin),
                            (probability_draw + margin) );
      ret = false;
    }
  }

  if ( ret == true ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_WARN(" TODO Warning smtc_modem_hal_get_random_nb_in_range error margin > 5%% \n");
  }

  SMTC_HAL_TRACE_PRINTF(" Random draw of %lu numbers between [%lu;%lu] range \n", nb_draw, range_min, range_max);

  return ret;
}

/**
 * @brief Test time to configure rx radio
 *
 * @remark
 * Test processing:
 * - Init radio
 * - Configure radio irq
 * - Get start time
 * - Configure rx radio
 * - Get stop time
 * - Check configuration time
 *
 * @return bool True if test is successful
 */
static bool porting_test_config_rx_radio(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_config_rx_radio :");

  bool ret = true;
  // uint32_t rx_timeout_in_ms = 500;
  uint16_t counter_nok = 0;
  radio_irq_raised     = false;

  // Reset, init and put it in sleep mode radio
  // Setup radio and relative irq
  ret = reset_init_radio( );
  if ( ret == false ) {
    return ret;
  }

  smtc_modem_hal_irq_config_radio_irq(radio_rx_irq_callback, NULL);

  for ( uint16_t i = 0; i < NB_LOOP_TEST_CONFIG_RADIO; i++ ) {
    radio_irq_raised = false;

    uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( );
    // Setup radio and relative irq
    smtc_modem_hal_start_radio_tcxo( );
    smtc_modem_hal_set_ant_switch(false);
    if ( ralf_setup_lora(&modem_radio, &rx_lora_param) != RAL_STATUS_OK ) {
      PORTING_TEST_MSG_NOK(" ralf_setup_lora() function failed \n");
      return false;
    }
    if ( ral_set_dio_irq_params(&(modem_radio.ral), RAL_IRQ_RX_DONE | RAL_IRQ_RX_TIMEOUT | RAL_IRQ_RX_HDR_ERROR
                                | RAL_IRQ_RX_CRC_ERROR) != RAL_STATUS_OK ) {
      PORTING_TEST_MSG_NOK(" ral_set_dio_irq_params() function failed \n");
      return false;
    }

    // Configure radio in reception mode
    // if( ral_set_rx( &( modem_radio.ral ), rx_timeout_in_ms ) !=
    //     RAL_STATUS_OK )
    // {
    //     PORTING_TEST_MSG_NOK( " ral_set_rx() function failed \n" );
    //     return false;
    // }

    uint32_t time = smtc_modem_hal_get_time_in_ms( ) - start_time_ms;
    if ( time >= MARGIN_TIME_CONFIG_RADIO_IN_MS ) {
      PORTING_TEST_MSG_NOK(" Configuration of rx radio is too long: %lums (margin +%ums) \n", time,
                           MARGIN_TIME_CONFIG_RADIO_IN_MS);
      counter_nok++;
    }
    // else
    // {
    //     SMTC_HAL_TRACE_PRINTF( " Configuration of rx radio is: %lums  \n", time );
    // }

    smtc_modem_hal_stop_radio_tcxo( );
  }

  if ( counter_nok == 0 ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_WARN(" => Failed test = %u / %u \n", counter_nok, NB_LOOP_TEST_CONFIG_RADIO);
  }

