SiliconLabsSoftware/devs-refd-lorawan/projects/lorawan_extension/components/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
  return true;
}

/**
 * @brief Test time to configure tx radio
 *
 * @remark
 * Test processing:
 * - Init radio
 * - Configure radio irq
 * - Get start time
 * - Configure tx radio
 * - Get stop time
 * - Check configuration time
 *
 * @return bool True if test is successful
 */
static bool porting_test_config_tx_radio(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_config_tx_radio :");

  uint16_t payload_size = 50;
  uint8_t  payload[50]  = { 0 };
  uint16_t counter_nok  = 0;
  radio_irq_raised      = false;

  // Reset, init and put it in sleep mode radio
  bool ret = reset_init_radio( );
  if ( ret == false ) {
    return ret;
  }

  // Setup radio and relative irq
  smtc_modem_hal_irq_config_radio_irq(radio_tx_irq_callback, NULL);

  for ( uint16_t i = 0; i < NB_LOOP_TEST_CONFIG_RADIO; i++ ) {
    radio_irq_raised = false;

    uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( );

    smtc_modem_hal_start_radio_tcxo( );
    smtc_modem_hal_set_ant_switch(true);
    if ( ralf_setup_lora(&modem_radio, &tx_lora_param) != RAL_STATUS_OK ) {
      PORTING_TEST_MSG_NOK(" ralf_setup_lora() function failed \n");
      return false;
    }
    if ( ral_set_dio_irq_params(&(modem_radio.ral), RAL_IRQ_TX_DONE) != RAL_STATUS_OK ) {
      PORTING_TEST_MSG_NOK(" ral_set_dio_irq_params() function failed \n");
      return false;
    }
    if ( ral_set_pkt_payload(&(modem_radio.ral), payload, payload_size) != RAL_STATUS_OK ) {
      PORTING_TEST_MSG_NOK(" ral_set_pkt_payload() function failed \n");
      return false;
    }
    // if( ral_set_tx( &( modem_radio.ral ) ) != RAL_STATUS_OK )
    // {
    //     PORTING_TEST_MSG_NOK( " ral_set_tx() function failed \n" );
    //     return false;
    // }

    uint32_t time = smtc_modem_hal_get_time_in_ms( ) - start_time_ms;
    if ( time >= MARGIN_TIME_CONFIG_RADIO_IN_MS ) {
      PORTING_TEST_MSG_NOK(" Configuration of tx radio is too long: %lums (margin +%ums) \n", time,
                           MARGIN_TIME_CONFIG_RADIO_IN_MS);
      counter_nok++;
    }
    // else
    // {
    //     SMTC_HAL_TRACE_PRINTF( " Configuration of tx radio is: %ums  \n", time );
    // }

    smtc_modem_hal_stop_radio_tcxo( );
  }
  if ( counter_nok == 0 ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_WARN(" => Failed test = %u / %u \n", counter_nok, NB_LOOP_TEST_CONFIG_RADIO);
  }
  return true;
}

/**
 * @brief Test sleep time
 *
 * @remark
 * Test processing:
 * - Get start time
 * - Set sleep for ms
 * - Get stop time
 * - Check sleep time
 *
 * Ported functions:
 * hal_mcu_set_sleep_for_ms
 *      hal_watchdog_reload
 *      hal_rtc_wakeup_timer_set_ms
 *      lpm_handler
 *      hal_rtc_wakeup_timer_stop
 *
 * @return bool True if test is successful
 */
static bool porting_test_sleep_ms(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_sleep_ms :");

  bool    ret           = true;
  int32_t sleep_ms      = 2000;
  uint8_t wait_start_ms = 5;

  // Wait 5ms to start
  uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( ) + wait_start_ms;
  while ( smtc_modem_hal_get_time_in_ms( ) < start_time_ms ) {
    //Do nothing
  }

  hal_mcu_set_sleep_for_ms(sleep_ms);
  uint32_t stop_time_ms = smtc_modem_hal_get_time_in_ms( );

  uint32_t time         = stop_time_ms - start_time_ms;

  if ( abs(time - sleep_ms) <= MARGIN_SLEEP_IN_MS ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF("Sleep time expected %lums / get %lums (margin +/-%ums) \n", sleep_ms, time,
                          MARGIN_SLEEP_IN_MS);
  } else {
    PORTING_TEST_MSG_WARN("\n => Sleep time is not coherent: expected %lums / get %lums (margin +/-%ums)\n",
                          sleep_ms, time, MARGIN_SLEEP_IN_MS);
  }
  return ret;
}

/**
 * @brief Test timer IRQ in low power
 *
 * @warning smtc_modem_hal_start_timer() function takes ~4ms for STM32L4 (see HAL_LPTIM_TimeOut_Start_IT())
 *
 * @remark
 * Test processing:
 * - Get start time
 * - Configure and start timer
 * - Wait timer irq
 * - Get stop time
 * - Check the time elapsed between timer start and timer IRQ reception
 *
 * Ported functions:
 * smtc_modem_hal_start_timer
 *      hal_lp_timer_start
 *
 * @return bool True if test is successful
 */
static bool porting_test_timer_irq_low_power(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_timer_irq_low_power : ");

  uint32_t timer_ms      = 3000;
  int32_t  sleep_ms      = timer_ms + 5000;
  uint8_t  wait_start_ms = 5;
  timer_irq_raised       = false;

  smtc_modem_hal_stop_timer( );

  // Wait 5ms to start
  uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( ) + wait_start_ms;
  while ( smtc_modem_hal_get_time_in_ms( ) < start_time_ms ) {
    // Do nothing
  }

  smtc_modem_hal_start_timer(timer_ms, timer_irq_callback,
                             NULL);

  hal_mcu_set_sleep_for_ms(sleep_ms);
  if ( timer_irq_raised == false ) {
    PORTING_TEST_MSG_NOK(" Timeout: timer irq not received \n");
    return false;
  }

  uint32_t time =
    irq_time_ms - start_time_ms - BOARD_COMPENSATION_IN_MS;
  if ( (time >= timer_ms) && (time <= timer_ms + MARGIN_TIMER_IRQ_IN_MS) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF("Timer irq configured with %lums / get %lums (margin +%ums) \n", timer_ms, time,
                          MARGIN_TIMER_IRQ_IN_MS);
  } else {
    PORTING_TEST_MSG_NOK(" Timer irq delay is not coherent: expected %lums / get %lums (margin +%ums) \n", timer_ms,
                         time, MARGIN_TIMER_IRQ_IN_MS);
    return false;
  }
  return true;
}

/*
 * -----------------------------------------------------------------------------
 * --- FLASH PORTING TESTS -----------------------------------------------------
 */
#if (ENABLE_TEST_FLASH != 0)

/**
 * @brief Test read/write context in flash
 *
 * @remark
 * Test processing:
 * - Read context in flash
 * - Write a different context in flash
 * - Read context in flash
 * - Check if read context is equal to written context
 *
 * Ported functions:
 * smtc_modem_hal_context_restore
 *     hal_flash_read_buffer
 * smtc_modem_hal_context_store
 *     hal_flash_write_buffer
 *
 * @param [in]  context_type   The context type
 *
 * @return bool True if test is successful
 */
static bool test_context_store_restore(modem_context_type_t context_type)
{
  bool    ret             = true;
  uint8_t read_buffer[8]  = { 0 };
  uint8_t write_buffer[8] = { 1, 2, 3, 4, 5, 6, 7, 8 };
  bool    cmp             = true;

  SMTC_HAL_TRACE_PRINTF("\n * Context %s : \n", name_context_type[context_type]);

