SiliconLabsSoftware/devs-refd-lorawan/projects/lorawan_extension/components/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
  smtc_modem_hal_context_restore(context_type, 0, read_buffer, sizeof(read_buffer) );

  SMTC_HAL_TRACE_MSG(" Read:  { ");
  for ( uint8_t i = 0; i < sizeof(read_buffer); i++ ) {
    SMTC_HAL_TRACE_PRINTF("%u", read_buffer[i]);
    if ( i != (sizeof(read_buffer) - 1) ) {
      SMTC_HAL_TRACE_MSG(", ");
    }
  }
  SMTC_HAL_TRACE_MSG(" }\n");

  for ( uint8_t i = 0; i < sizeof(write_buffer); i++ ) {
    if ( read_buffer[i] == write_buffer[i] ) {
      write_buffer[i] = (read_buffer[i] + 1) % 256;
    }
  }

  SMTC_HAL_TRACE_MSG(" Write: { ");
  for ( uint8_t i = 0; i < sizeof(write_buffer); i++ ) {
    SMTC_HAL_TRACE_PRINTF("%u", write_buffer[i]);
    if ( i != (sizeof(write_buffer) - 1) ) {
      SMTC_HAL_TRACE_MSG(", ");
    }
  }
  SMTC_HAL_TRACE_MSG(" }\n");

  smtc_modem_hal_context_store(context_type, 0, write_buffer, sizeof(write_buffer) );

  memset(read_buffer, 0, sizeof(read_buffer) );
  smtc_modem_hal_context_restore(context_type, 0, read_buffer, sizeof(read_buffer) );

  SMTC_HAL_TRACE_MSG(" Read:  { ");
  for ( uint8_t i = 0; i < sizeof(read_buffer); i++ ) {
    SMTC_HAL_TRACE_PRINTF("%u", read_buffer[i]);
    if ( i != (sizeof(read_buffer) - 1) ) {
      SMTC_HAL_TRACE_MSG(", ");
    }
  }
  SMTC_HAL_TRACE_MSG(" }\n");

  for ( uint8_t i = 0; i < sizeof(write_buffer); i++ ) {
    if ( read_buffer[i] != write_buffer[i] ) {
      cmp = false;
    }
  }
  if ( cmp == true ) {
    SMTC_HAL_TRACE_MSG(" Store/restore without MCU reset :");
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_NOK(" Store or restore context failed (without MCU reset) \n\n");
    return false;
  }

  return ret;
}

/**
 * @brief Test read/write context in flash
 *
 * @remark
 * Test processing:
 * - See test_context_store_restore() function
 * - Reset MCU
 * - RELAUNCH this test after mcu reset
 * - Check if read after reset = write before reset
 *
 * @return bool True if test is successful
 */
static bool porting_test_flash(void)
{
  bool ret = true;
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_flash : \n");
  SMTC_HAL_TRACE_MSG_COLOR(" !! TEST TO BE LAUNCH TWICE !! To check writing after MCU reset \n",
                           HAL_DBG_TRACE_COLOR_BLUE);

  /* LORAWAN */
  ret = test_context_store_restore(CONTEXT_LORAWAN_STACK);
  if ( ret == false ) {
    return ret;
  }

  /* MODEM */
  ret = test_context_store_restore(CONTEXT_MODEM);
  if ( ret == false ) {
    return ret;
  }

  /* MODEM KEY */
  ret = test_context_store_restore(CONTEXT_KEY_MODEM);
  if ( ret == false ) {
    return ret;
  }

  /* SECURE ELEMENT */
  ret = test_context_store_restore(CONTEXT_SECURE_ELEMENT);
  if ( ret == false ) {
    return ret;
  }

  return ret;
}
#endif

/*
 * -----------------------------------------------------------------------------
 * --- IRQ CALLBACK DEFINITIONS ---------------------------------------------------------
 */

/**
 * @brief Radio tx irq callback
 */
static void radio_tx_irq_callback(void* obj)
{
  UNUSED(obj);
  irq_time_ms = smtc_modem_hal_get_time_in_ms( );
  radio_irq_raised = true;
  if (ral_clear_irq_status(&(modem_radio.ral), RAL_IRQ_ALL) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_clear_irq_status() function failed \n");
  }
}

/**
 * @brief Radio rx irq callback (get time in ms)
 */
static void radio_rx_irq_callback(void* obj)
{
  UNUSED(obj);

  ral_irq_t radio_irq = 0;
  irq_time_ms         = smtc_modem_hal_get_time_in_ms( );
  radio_irq_raised    = true;

  if ( ral_get_irq_status(&(modem_radio.ral), &radio_irq) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_get_irq_status() function failed \n");
  }

  if ( (radio_irq & RAL_IRQ_RX_TIMEOUT) == RAL_IRQ_RX_TIMEOUT ) {
    irq_rx_timeout_raised = true;
  }

  if ( ral_clear_irq_status(&(modem_radio.ral), RAL_IRQ_ALL) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_clear_irq_status() function failed \n");
  }

  // Shut Down the TCXO
  smtc_modem_hal_stop_radio_tcxo( );
}

/**
 * @brief Radio irq callback (get time in s)
 */
static void radio_irq_callback_get_time_in_s(void* obj)
{
  UNUSED(obj);
  ral_irq_t radio_irq = 0;
  irq_time_s          = smtc_modem_hal_get_time_in_s( );
  radio_irq_raised    = true;
  if ( ral_get_irq_status(&(modem_radio.ral), &radio_irq) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_get_irq_status() function failed \n");
  }

  if ( (radio_irq & RAL_IRQ_RX_TIMEOUT) == RAL_IRQ_RX_TIMEOUT ) {
    irq_rx_timeout_raised = true;
  }

  if ( ral_clear_irq_status(&(modem_radio.ral), RAL_IRQ_ALL) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_clear_irq_status() function failed \n");
  }

  // Shut Down the TCXO
  smtc_modem_hal_stop_radio_tcxo( );
}

/**
 * @brief Timer irq callback
 */
static void timer_irq_callback(void* obj)
{
  UNUSED(obj);
  irq_time_ms      = smtc_modem_hal_get_time_in_ms( );
  timer_irq_raised = true;
}

#ifdef SL_CATALOG_KERNEL_PRESENT
static void app_task(void *argument)
{
  (void)&argument;
  for (;; ) {
    app_process_action();
    osDelay(1);
  }
}
#endif

/* --- EOF ------------------------------------------------------------------ */
